Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions
The Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions class provides a set of extension methods for Tekla.Structures.Model.UI.ViewCamera.

Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions.GetClippingPlanes(Tekla.Structures.Model.UI.ViewCamera)
Gets the clipping planes for the Tekla.Structures.Model.UI.ViewCamera.
viewCamera: The Tekla.Structures.Model.UI.ViewCamera to get the clipping planes for.
Returns: The sequence of clipping planes.

Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions.DotExportSelectViewClippingPlanes(System.Int32,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t@)
Selects the clipping planes of the view with the given viewId.
viewId: The identifier of the view to get the clipping planes for.
viewClippingPlanes: The clipping planes of the view.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions.TryConvert(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t,Tekla.BIM.DirectManipulation.Services.Graphics.ViewClippingPlanes@)
Tries to convert a Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t value to a Tekla.BIM.DirectManipulation.Services.Graphics.ViewClippingPlanes value.
dotViewClippingPlanes: The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t value to convert.
viewClippingPlanes: The converted Tekla.BIM.DirectManipulation.Services.Graphics.ViewClippingPlanes.
Returns: True if the conversion succeeded; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions.TryToPlane3(Tekla.Structures.ModelInternal.dotClipPlane_t,Tekla.Common.Geometry.Plane3@)
Tries to convert a Tekla.Structures.ModelInternal.dotClipPlane_t value to a Tekla.Common.Geometry.Plane3 value.
clipPlane: The Tekla.Structures.ModelInternal.dotClipPlane_t value to convert.
plane: The converted Tekla.Common.Geometry.Plane3.
Returns: True if the conversion succeeded; otherwise, false.